.svn/pristine/3e/3e951ef48e65a5a3153000cfc917324fb444c879.svn-base

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:q0="http://premiumws.premiumwrapper.motor.itgi.com" xmlns:q1="http://premiumwrapper.motor.itgi.com" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <q0:getMotorPremium>
      <q0:policyHeader>
        <q1:messageId>1234</q1:messageId>
      </q0:policyHeader>
      <q0:policy>
        <q1:contractType>PCP</q1:contractType>
        <q1:expiryDate>___policy_expiry_date___ 00:00:00</q1:expiryDate>
        <q1:inceptionDate>___policy_start_date___ 00:00:00</q1:inceptionDate>
        <q1:previousPolicyEndDate>___policy_end_date___</q1:previousPolicyEndDate>
        <q1:vehicle>
          <q1:aaiExpiryDate></q1:aaiExpiryDate>
          <q1:aaiNo ></q1:aaiNo>
          <q1:capacity>5</q1:capacity>
          <q1:engineCpacity>1061</q1:engineCpacity>
          <q1:grossVehicleWt />
          <q1:itgiRiskOccupationCode></q1:itgiRiskOccupationCode>
          <q1:itgiZone />
          <q1:make>___dbmaster_insurer_vehicle_make_code___</q1:make>
          <q1:regictrationCity>MAHMUMBAI</q1:regictrationCity>
          <q1:registrationDate>___vehicle_registration_date___</q1:registrationDate>
          <q1:seatingCapacity>5</q1:seatingCapacity>
          <q1:type />
          <q1:vehicleBody />
          <q1:vehicleClass>PCP</q1:vehicleClass>
          <q1:vehicleCoverage>
            <q0:item>
              <q1:coverageId>IDV Basic</q1:coverageId>
              <q1:number></q1:number>
              <q1:sumInsured>___vehicle_idv___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>PA Owner / Driver</q1:coverageId>
              <q1:number />
              <q1:sumInsured>Y</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>TPPD</q1:coverageId>
              <q1:number />
              <q1:sumInsured>750000</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>CNG Kit Company Fit</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___external_bifuel_type_2___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>CNG Kit</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___external_bifuel_value___</q1:sumInsured>
            </q0:item>
              <q0:item>              
              <q1:coverageId>Legal Liability to Driver</q1:coverageId> 
              <q1:number />
              <q1:sumInsured>___is_llpd___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>PA to Passenger</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___pa_unnamed_passenger_si_2___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>No Claim Bonus</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___vehicle_ncb_current___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>Voluntary Excess</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___voluntary_deductible___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>Anti-Theft</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___is_antitheft_fit___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>Electrical Accessories</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___electrical_accessory___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>Cost of Accessories</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___non_electrical_accessory___</q1:sumInsured>
            </q0:item>
            <q0:item>
              <q1:coverageId>AAI Discount</q1:coverageId>
              <q1:number />
              <q1:sumInsured>___is_aai_membership___</q1:sumInsured>
            </q0:item>
          </q1:vehicleCoverage>
          <q1:vehicleSubclass>PCP</q1:vehicleSubclass>
          <q1:yearOfManufacture>___vehicle_manf_date_2___</q1:yearOfManufacture>
          <q1:zcover>CO</q1:zcover>
        </q1:vehicle>
      </q0:policy>
      <q0:partner>
        <q1:partnerBranch>___insurer_integration_location_code___POLICY_BOSS</q1:partnerBranch>
        <q1:partnerCode>___insurer_integration_agent_code___ITGIMOT024</q1:partnerCode>
        <q1:partnerSubBranch>POLICY_BOSS</q1:partnerSubBranch>
      </q0:partner>
    </q0:getMotorPremium>
  </soapenv:Body>
</soapenv:Envelope>